-- phpMyAdmin SQL Dump
-- version 4.0.10deb1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Sep 04, 2015 at 08:33 PM
-- Server version: 5.5.35-1ubuntu1
-- PHP Version: 5.5.9-1ubuntu4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `artidb`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE IF NOT EXISTS `admins` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `family` varchar(20) NOT NULL,
  `username` varchar(30) NOT NULL,
  `password` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `name`, `family`, `username`, `password`) VALUES
(2, 'امید', 'بیگی', 'omid', '123');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE IF NOT EXISTS `comments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `judge` int(11) NOT NULL,
  `paper` int(11) NOT NULL,
  `text` varchar(100) NOT NULL,
  `date` date NOT NULL,
  `rate` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `judge`, `paper`, `text`, `date`, `rate`) VALUES
(1, 7, 25, 'بسیار عالی', '2015-09-23', 9),
(2, 8, 25, 'بد نیست', '2015-09-16', 9),
(3, 9, 25, 'عالی', '2015-09-02', 10);

-- --------------------------------------------------------

--
-- Table structure for table `judges`
--

CREATE TABLE IF NOT EXISTS `judges` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `family` varchar(20) NOT NULL,
  `username` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `tel` bigint(20) unsigned NOT NULL,
  `email` varchar(30) NOT NULL,
  `address` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- Dumping data for table `judges`
--

INSERT INTO `judges` (`id`, `name`, `family`, `username`, `password`, `tel`, `email`, `address`) VALUES
(7, 'آرزو', 'ایزدی', 'arezo', '123', 2147483647, 'arezo@gmail.com', 'امامیه'),
(8, 'مجتبی', 'احمدی', 'mojtaba', '123', 2147483647, 'mojtaba@yahoo.com', 'ادیب'),
(9, 'فاطمه', 'ابیری', 'abiri', '123', 9156835248, 'abiri@gmail.com', 'مشهد');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `admin` int(11) NOT NULL,
  `text` varchar(10240) NOT NULL,
  `date` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=69 ;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `admin`, `text`, `date`) VALUES
(40, 1, 'پیشرفت مهم دیگر استفاده از کاتالیزورهای ارزان و فعال برای تولید سوخت است. فتوآند نیازمند یک کاتالیزور برای انجام واکنش جداسازی آب است. فلزات کمیاب و گران قیمتی مانند پلاتین می توانند به عنوان کاتالیزوری کارآمد استفاده شوند اما تیم پژوهشی طی بررسی های خود دریافتند می توانند کاتالیزور فعال ارزان‌تری را با استفاده از افزودن لایه ای با ضخامت دو نانومتر از نیکل به سطح دی اکسید تیتانیوم تولید کنند. ', '2015-08-12'),
(42, 2, 'نمیه رساناهایی مانند سیلیکون یا آرسنید گالیم به خوبی نور را جذب می کنند و از این رو در پنل های خورشیدی به کار گرفته می شوند. با این وجود، سطح این مواد در مواجهه با آب اکسید می شود و بر همین اساس به طور مستقیم برای تولید سوخت قابل استفاده نیستند.\n\nآزمایش پیشین در آزمایشگاه لوئیس به پیشرفتی چشمگیر در طراحی منجر شده بود. این آزمایش نشان داده بود افزودن لایه ای با ضخامت نانومتری از دی اکسید تیتانیوم (TiO2) - ماده ای که در رنگ سفید و بسیاری از خمیردندان ها و کرم های ضد آفتاب یافت می شود - به الکترودها از زنگ زدگی آنها جلوگیری می کند در شرایطی که همچنان به نور و الکترون اجازه عبور می دهد. ', '2015-08-13'),
(43, 2, 'به گفته "نیت لوئیس"، استاد شیمی در موسسه فناوری کالیفرنیا، بخش کلیدی این طراحی غشا پلاستیکی آن است که گازهای اکسیژن و هیدروژن را جدا نگه می دارد. اگر این دو گاز اجازه ترکیب پیدا کنند و به طور تصادفی مشتعل شوند ممکن است انفجار رخ دهد؛ غشا این امکان را فراهم می کند تا گاز هیدروژن به صورت جداگانه زیر فشار جمع آوری شود و به طور امن راهی یک خط لوله شود. ', '2015-08-14'),
(44, 2, 'جریان به سرعت در حال رشد اینترنت اشیا بسیار هیجان انگیز است. هر روز دستگاه های جدیدی معرفی می شوند که توانایی اتصال به اینترنت برای کنترل چیزی را دارند. جهان به تدریج در حال پر شدن از دستگاه های شبکه شده است که در نهایت تسهیل زندگی برای ما را به همراه دارد.', '2015-08-15'),
(45, 2, 'به گزارش "گروه علم و فناوری" عصرایران، دستگاه های شبکه شده دستگاه های الکترونیکی مانند لوازم خانگی هستند که توانایی اتصال به اینترنت را دارند. به زودی، هر فردی توانایی خرید محصولی را دارد که می تواند با استفاده از آن چراغ ها را خاموش کند و یا در پارکینگ را هنگامی که در خانه نیست، قفل کند. ما در جهانی زندگی خواهیم کرد که همه چیز در آن هوشمند است. شاید هنوز چند سال تا استفاده گسترده مردم از این نوع دستگاه ها فاصله داشته باشیم اما این فناوری برای هر فردی که یک تلفن هوشمند در دست دارد، موجود است. ', '2015-08-16'),
(46, 2, 'آینده اینترنت اشیا اتوماسیون خانگی را در بر می گیرد. ممکن است با خود بگویید خانه های ما چندین سال است که حالت خودکار به خود گرفته اند و در پارکینگ را با ریموت باز و بسته می کنیم یا چراغ ها را تنها با زدن یک کلید خاموش می کنیم. با این وجود، اتوماسیون خانگی به بستری برای گسترش جریان فزاینده "خانه هوشمند" تبدیل شده است. دیگر باز و بسته کردن در پارکینگ با ریموت موضوع تاثیرگذاری محسوب نمی شود بلکه بررسی شرایط آن از طریق تلفن هوشمند هنگامی که کیلومترها از خانه فاصله دارید موضوع جذاب امروز است. ', '2015-08-19'),
(47, 2, 'سیستم های اتوماسیون خانه هوشمند این امکان را برای کاربران فراهم کرده اند تا فعالیت هایی مانند تنظیمات ترموستات، باز و بسته کردن قفل درها، خاموش و روشن کردن چراغ ها، روشن کردن ماشین ظرفشویی و ... را تنها از طریق فرمان های صوتی یا چند لمس ساده تلفن هوشمند خود انجام دهند. موارد این چنینی فوق العاده هستند اما مزایای در اختیار داشتن یک خانه هوشمند چیست؟ ', '2015-08-24'),
(49, 2, 'به گفته نیت لوئیس، پژوهش صورت گرفته نشان می دهد امکان تولید سوخت از نور خورشید به طور ایمن و کارآمد در یک سیستم یکپارچه شده با اجزایی ارزان وجود دارد. تردیدی وجود ندارد که فعالیت های بیشتری برای افزایش طول عمر سیستم و توسعه روش های مقرون به صرفه تولید سیستم های کامل نیاز است که هر دو مورد در حال پیشرفت هستند.', '2015-08-28'),
(50, 2, 'فناوری و تکنولوژی های نظامی همانند دیگر صنایع جهان به سرعت در حال مدرنیزه شدن است.این پیشرفت تا حد بسیاری مدیون پیشرفت های الکترونیکی و سخت افزاری است.بدون این فناوری ها،ادوات نظامی فقط مقداری آهن و موارد اولیه هستند.برخی از کشورهای جهان مانند آمریکا،روسیه،انگلستان و فرانسه از بزرگترین تولید کنندگان بومی تجهزات نظامی در جهان هستند.اما متاسفانه همیشه اشتباهاتی در ساخت و تولید این تجهیزات باعث به وجود آمدن مشکلاتی جبران ناپذیر خواهد شد.علاوه بر اشتباهات مهندسی،عدم آمورش کافی پرسنل نیز در این مشکلات دخیل هستند.', '2015-08-30'),
(51, 2, 'زیر دریایی ها جزو افتخارات بشریت هستند که که توانایی کاوش و حرکت در زیر دریاها و اقیانوس ها را برای انسان ها فراهم کرده است.علاوه بر آن زیردریایی ها هم اکنون به عنوان یکی از مخربترین سلاح های نظامی به شمار میروند که برخی از کشورهای جهان با مسلح کردن آنها به موشک ها اتمی،یک زرادخانه اتمی سیار در زیر اقیانوس ها دارند.اما این زرادخانه ها همیشه هم بی خطر نبوده و مشکلات بسیاری را به وجود آورده اند.', '2015-09-02'),
(68, 2, 'تاکید ویژه مدیرعامل هواوی بر بهینه‌سازی‌های انجام شده در زمینه بهره‌گیری از نمایه‌های حرکتی در قالب سنسور تشخیص اثرانگشت و البته کارایی Knuckle Sense 2.0 و نهایتا صفحه‌نمایش مجهز به قابلیت فورس تاچ است. آن‌طور که عنوان شده سرعت و دقت سنسور تشخیص اثرانگشت تا صد درصد بهبود یافته است و امکان بهره‌گیری از کشیدن‌های جهتی انگشت به‌منظور اجرای قابلیتی خاص نیز امکان‌پذیر شده است. گرفتن عکس، دسترسی به قسمت هشدارها و پاسخگویی به تماس‌های ورودی از جمله قابلیت‌های موجود هستند که می‌توانید با استفاده از این سنسور تشخیص اثرانگشت پیاده‌سازی کنید.', '2015-09-04');

-- --------------------------------------------------------

--
-- Table structure for table `papers`
--

CREATE TABLE IF NOT EXISTS `papers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user` int(11) NOT NULL,
  `subject` varchar(1024) NOT NULL,
  `date` date NOT NULL,
  `summary` varchar(10240) NOT NULL,
  `accept` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=26 ;

--
-- Dumping data for table `papers`
--

INSERT INTO `papers` (`id`, `user`, `subject`, `date`, `summary`, `accept`) VALUES
(14, 9, 'امنیت شبکه های وایرلس', '2015-08-19', 'شبکه وایرلس به کاربر اجازه می دهد که به یک شبکه محلی یا اینترنت وصل شود در واقع بسته های اطلاعات بوسیله امواج الکترو مغناطیس پراکنده شده و با استفاده از هوا بعنوان واسط انتقال ، منتقل می شوند پس قابلیت اتصال به داده ها و رد و بدل کردن اطلاعات بدون نیاز به روند پرهزینه کابل کشی با کیفیت مشابه انتقال دیتا در شبکه های کابلی عواملی هستند که باعث گسترش و تکامل این نوع شبکه ها (وایرلس) گردید. استفاده هر روزه توسط افراد مختلف در کل دنیا باعث نیاز ها و مشکلاتی گردیده که در اولویت آنها امنیت این نوع شبکه ها دیده می شود در همین خصوص و در جهت بهبود امنیت این شبکه ها قدم های بسیاری برداشته شده و ابزارهای امنیتی چشم گیری هم روانه بازار شد که امنیت این نوع شبکه ها را بیش از پیش افزایش داده است و در این مقاله به امنیت این نوع شبکه های می پردازیم', 1),
(22, 9, 'شبکه های کامپیوتری و حسگر بیسیم', '2015-08-21', 'هدف از این پروژه معرفی شبیه سازی شبکه های کامپیوتری است. شبیه سازی شبکه تکنیکی است که رفتار شبکه را با انجام محاسبات تراکنشها بین موجودیت های مختلف شبکه و استفاده از فرمولهای ریاضی و گرفتن مشاهدات از محصولات شبکه مدل می کند. شبیه ساز شبکه یک قطعه نرم افزار یا سخت افزار است که رفتار شبکه رایانه ای را بدون حضور یک شبکه واقعی پیش بینی می کند. شیبه ساز شبکه، برنامه نرم افزاری است که عملکرد یک شبکه کامپیوتری را تقلید می کند. در شبیه سازها، شبکه کامپیوتری با دستگاه ها و ترافیک و… مدل شده و سپس کارایی آن آنالیز و تحلیل می شود. معمولاً کاربران می توانند شبیه ساز را برای عملی کردن نیازهای تحلیلی خاص خودشان سفارشی کنند. هدف نهایی این پروژه، پیاده سازی یک شبکه ی حسگر بی سیم با استفاده از شبیه ساز NS2 می باشد که در فصل پنجم این پایان نامه به آن پرداخته شده است.', 1),
(23, 10, ' آشنایی با گوگل آنالاتیک', '2015-08-24', 'گوگل انالیتیکس یک سرویس رایگان پیش آوری شده گوگل است که آمار بازدید کنندگان یک وب سایت را نشان می‌دهد. این دستاورد برای بازاریابان و وب مسترها برای واکاوی وب بکار گرفته می‌شود. این سیستم امکان بررسی و تحلیل ورودی‌ها، صفحات ورودی دهنده، کاربران وارد شده، فعالیت‌های کاربران، زمان حضور و مسیر خروجی آنها را ارائه می‌کند. به این ترتیب، گستره وسیعی از اطلاعات در اختیار مدیریت سایت قرار خواهد گرفت. از امکانات این سیستم هدف گذاری مشخص در بازه زمانی است. سپس سیستم خودکار در بازه زمانی تعیین شده در صورت دست یابی به هدف گزارش مبنی بر رسیدن به هدف می‌دهد و در صورت عقب ماندن از هدف نیز درصد نزدیکی به هدف را ارائه می‌کند.', 1),
(24, 10, 'شناسایی چهره با استفاده از الگوریتم کلونی مورچگان', '2015-08-28', 'ابتدا با استفاده از اجرای فایل ExteractFeatureZernik_Dw ویژگی های زرنیک و DWT که مربوط به ویولت هست را از ۴۰۰ تصویر بیرون کشیده و در یک ماتریس با ۴۰۰ ردیف ذخیره می کنیم. تعداد ویژگی های استخراجی برای DWT برابر ۱۶۸ ویژگی است. که با توجه به مقاله ی شماره ۲(شکل۴ مقاله) که در فایل پروژه هست پیاده سازی شده است. تصاویر پایگاه داده ۹۲×۱۱۲ می باشد سه سطح رزولوشن آن باستفاده از تبدیل وارون ویولت کم می شود سطح اول ۴۶×۵۶ ، سطح دوم ۲۳×۲۸ و سطح سوم و آخر ۱۲×۱۴ می شود. در این مرحله تصویر با ابعاد سطح سوم را به صورت برداری تک ردیف ارائه می کنیم و اینکار با کنار هم و بهم پیوست ستون ها انجام می دهیم. که برای هر تصویر بردار ویژگی DWT برداری با طول ۱۶۸ خواهد بود زیرا ۱۲×۱۴=۱۶۸ خواهد شد. پس از استخراج ویژگی های آنها را در ماتریس Feature_DWT.mat با ابعاد ۴۰۰×۱۶۸ برای استفاده ی الگوریتم ACO ذخیره می کنیم. به منظور استخراج ویژگی-های زرنیک نیز از به جای استفاده مستقیم از تصاویر پایگاه داده از تصاویر کاهش یافته ی ۶۴×۶۴ استفاده شده است. که فقط ۲۰ مرتبه ی اول ویزگی های زرنیک محاسبه می شود. و دراین حالت نیز ماتریس با نام Zernike_Moment_features.mat با ابعاد ۴۰۰×۲۰ را به منظور استفاده ACO ذخیره می کنیم.', 1),
(25, 11, 'فیشینگ و راه های مقابله با آن', '2015-09-02', ' فیشینگ یک بازی فریب دهنده و یک شکل از سرقت هویت آنلاین است که بدلیل رایج بودن این نوع حمله و استفاده از روش های “مهندس اجتماعی” قربانی را ترغیب به ثبت اطلاعات می کند. در این مقاله شما را با نحوه ی مقابله با این حملات آشنا می کنیم', 1);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `family` varchar(20) NOT NULL,
  `username` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `tel` int(11) NOT NULL,
  `email` text NOT NULL,
  `address` varchar(20) NOT NULL,
  `degree` varchar(20) NOT NULL,
  `accept` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=12 ;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `family`, `username`, `password`, `tel`, `email`, `address`, `degree`, `accept`) VALUES
(9, 'نازنین', 'ایرانی', 'nazi', '123', 2147483647, 'nazi@gmail.com', 'امامیه', 'لیسانس', 1),
(10, 'رویا', 'راستگو', 'roya', '123', 2147483647, 'roya@yahoo.com', 'ادیب', 'لیسانس', 1),
(11, 'شکیبا', 'صحرایی', 'shakib', '123', 2147483647, 'shakiba@gmail.com', 'سجاد', 'دکتری', 1);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
